In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:kipsang@localhost:3306/company_data

Connecting to 'mysql+pymysql://root:***@localhost:3306/company_data'

In [3]:
%%sql
SELECT
        *
FROM
    Company_employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

5 rows affected.

+-------------+----------+----------+-----------+------------+------------+
| Employee_id |   Name   | Job_code | Job_title | State_code | Home_state |
+-------------+----------+----------+-----------+------------+------------+
|     E001    |  Carmel  |   J01    |    Chef   |     26     | Cape Town  |
|     E001    |  Carmel  |   J02    |   Waiter  |     26     | Cape Town  |
|     E002    | Stefanie |   J02    |   Waiter  |     56     |   Joburg   |
|     E002    | Stefanie |   J03    | Bartender |     56     |   Joburg   |
|     E003    |   Lisa   |   J01    |    Chef   |     5      |  Nairobi   |
+-------------+----------+----------+-----------+------------+------------+

In [4]:
%%sql
DROP TABLE IF EXISTS Employees;

CREATE TABLE Employees (PRIMARY KEY(`Employee_id`)) AS
SELECT
    DISTINCT Employee_id,
    Name,
    State_code,
    Home_state
FROM
    Company_employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

3 rows affected.

++
||
++
++

In [5]:
%%sql

DROP TABLE IF EXISTS Jobs;

CREATE TABLE Jobs (PRIMARY KEY(`Job_code`)) AS
SELECT
    DISTINCT Job_code,
    Job_title
FROM
    Company_employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

3 rows affected.

++
||
++
++

In [6]:
%%sql

DROP TABLE IF EXISTS Employee_roles;

CREATE TABLE Employee_roles (PRIMARY KEY(`Employee_id`, `Job_code`)) AS
SELECT
    Employee_id,
    Job_code
FROM
    Company_employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

5 rows affected.

++
||
++
++

In [7]:
%%sql

DROP TABLE IF EXISTS States;

CREATE TABLE States (PRIMARY KEY(`State_code`)) AS
SELECT
    State_code,
    Home_state
FROM
    Employees;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

3 rows affected.

++
||
++
++

In [8]:
%%sql

ALTER TABLE Employees
DROP COLUMN Home_state;

Running query in 'mysql+pymysql://root:***@localhost:3306/company_data'

++
||
++
++